Tekla.Structures.Geometry3d.ICurve
Interface that represents an abstract curved geometry defined by a set of points. This interface is intended
to be the base class of 3D curves.

Tekla.Structures.Geometry3d.ICurve.Clone
Returns a deep copy of the geometry
Returns: Copy of self

Tekla.Structures.Geometry3d.ICurve.StartPoint
Gets the start point of the curve

Tekla.Structures.Geometry3d.ICurve.EndPoint
Gets the end point of the curve. May be the same as Tekla.Structures.Geometry3d.ICurve.StartPoint if the curve is closed.

Tekla.Structures.Geometry3d.ICurve.Length
Gets the length of the curve